# IFC_DMSetFieldOpt

```pascal
FUNCTION IFC_DMSetFieldOpt(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING;
				bOptional      : BOOLEAN): BOOLEAN;
```

```python
def vs.IFC_DMSetFieldOpt(inStrObjName, inStrEntryName, inStrFieldName, bOptional):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING|   |
|inStrEntryName|STRING|   |
|inStrFieldName|STRING|   |
|bOptional|BOOLEAN|   |

## Version
Available from: Vectorworks 2017

## Category
* IFC